odIfcInitialize(System.Boolean,System.Boolean,ModelerType)
\details
Initializes IFC SDK functionality.
\param initCDA             [in] A flag that determines whether Common Data Access (CDA) functionality should be provided for IFC data.
\param initIfcGeomResource [in] A flag that determines whether geometry resources are initialized as well (if equal to true) or not (if equal to false).
\param modelerType         [in] A type of modeler that should be used for geometry creation.
\returns eOk if IFC SDK was successfully initialized; otherwise, the function returns an appropriate error code.
\remarks
The function checks whether all needed modules are loaded and loads them if they are not.
If at least one of the necessary modules is not loaded, the function returns the eNullPtr error code.
It the bInitIfcGeomResource parameter value is equal to false, the IFC geometry library is unavailable,
therefore the model cannot be visualized. In this mode only data management functionality is available.